---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TableSectionData..::..SetCellStyle Method
TableSectionData Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SetCellStyle(TableCellStyle) | Sets a section's style |
|  | SetCellStyle(Int32, TableCellStyle) | Sets a column's style. |
|  | SetCellStyle(Int32, Int32, TableCellStyle) | Sets a cell's style |

# See Also

TableSectionData Class

TableSectionData Members

Autodesk.Revit.DB Namespace